LuisMedina117/VSG_Control_Inteligente/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UART();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
	CLOCK_EnableClock(kCLOCK_Iomuxc);
	CLOCK_EnableClock(kCLOCK_IomuxcSnvs);

	// Configuración de pin para botón de la tarjeta -----------------------------------------------
	IOMUXC_SetPinMux(IOMUXC_SNVS_WAKEUP_GPIO5_IO00, 0U);
	IOMUXC_SetPinConfig(IOMUXC_SNVS_WAKEUP_GPIO5_IO00,
		IOMUXC_SW_PAD_CTL_PAD_SRE(0U)	|	// Slew Rate: Slow
		IOMUXC_SW_PAD_CTL_PAD_DSE(0U)	|	// Drive Stregnth: Salida deshabilitada (entrada)
		IOMUXC_SW_PAD_CTL_PAD_SPEED(0U)	|	// Speed: Slow (50MHz)
		IOMUXC_SW_PAD_CTL_PAD_ODE(0U)	|	// Open Drain: Deshabilitado
		IOMUXC_SW_PAD_CTL_PAD_PKE(1U)	|	// Pull/Keeper Enable: Deshabilitado
		IOMUXC_SW_PAD_CTL_PAD_PUE(1U)	|	// Pull/Keeper Select: Pull
		IOMUXC_SW_PAD_CTL_PAD_PUS(2U)	|	// Pull Up/Down Config: 100k Ohm Pull Up
		IOMUXC_SW_PAD_CTL_PAD_HYS(0U)	);	// Hysteresis Enable: Deshabilitado

	// Configuración de pin de LED de la tarjeta ---------------------------------------------------
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_09_GPIO1_IO09, 0U);
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_09_GPIO1_IO09,
		IOMUXC_SW_PAD_CTL_PAD_SRE(0U)	|	// Slew Rate: Slow
		IOMUXC_SW_PAD_CTL_PAD_DSE(6U)	|	// Drive Stregnth: R0/6
		IOMUXC_SW_PAD_CTL_PAD_SPEED(2U)	|	// Speed: Medium (100MHz)
		IOMUXC_SW_PAD_CTL_PAD_ODE(0U)	|	// Open Drain: Deshabilitado
		IOMUXC_SW_PAD_CTL_PAD_PKE(1U)	|	// Pull/Keeper Enable: Enabled
		IOMUXC_SW_PAD_CTL_PAD_PUE(0U)	|	// Pull/Keeper Select: Keeper
		IOMUXC_SW_PAD_CTL_PAD_PUS(0U)	|	// Pull Up/Down Config: 100k Ohm Pull Down (Sin efecto con keeper)
		IOMUXC_SW_PAD_CTL_PAD_HYS(0U)	);	// Hysteresis Enable: Deshabilitado

	// Configuración de pines GPIO -----------------------------------------------------------------
	uint32_t config_pines =
		IOMUXC_SW_PAD_CTL_PAD_SRE(0U)	|	// Slew Rate: Slow
		IOMUXC_SW_PAD_CTL_PAD_DSE(6U)	|	// Drive Stregnth: R0/6
		IOMUXC_SW_PAD_CTL_PAD_SPEED(2U)	|	// Speed: Medium (100MHz)
		IOMUXC_SW_PAD_CTL_PAD_ODE(0U)	|	// Open Drain: Deshabilitado
		IOMUXC_SW_PAD_CTL_PAD_PKE(1U)	|	// Pull/Keeper Enable: Enabled
		IOMUXC_SW_PAD_CTL_PAD_PUE(0U)	|	// Pull/Keeper Select: Keeper
		IOMUXC_SW_PAD_CTL_PAD_PUS(0U)	|	// Pull Up/Down Config: 100k Ohm Pull Down (Sin efecto con keeper)
		IOMUXC_SW_PAD_CTL_PAD_HYS(0U);		// Hysteresis Enable: Deshabilitado
	// Pin 1 para medición de tiempo de ejecución   ----------   [GPIO 1, pin 2] {D9}
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, 0U);
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_02_GPIO1_IO02, config_pines);
	// Pin 2 para medición de tiempo de ejecución   ----------   [GPIO 1, pin 3] {D8}
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, 0U);
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_03_GPIO1_IO03, config_pines);
	// Pin para control de interruptor de conexión -----------   [GPIO 1, pin23] {D0}
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, 0U);
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_07_GPIO1_IO23, config_pines);

	// Configuración de pines para PWM -------------------------------------------------------------
	IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_00_FLEXPWM1_PWMA00, 0U);	// ----- [PWM1, módulo 0, canal A] {D13}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_00_FLEXPWM1_PWMA00, config_pines);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_01_FLEXPWM1_PWMB00, 0U);	// ----- [PWM1, módulo 0, canal B] {D10}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_01_FLEXPWM1_PWMB00, config_pines);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01, 0U);	// ----- [PWM1, módulo 1, canal A] {D11}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_02_FLEXPWM1_PWMA01, config_pines);
	IOMUXC_SetPinMux(IOMUXC_GPIO_SD_B0_03_FLEXPWM1_PWMB01, 0U);	// ----- [PWM1, módulo 1, canal B] {D12}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_SD_B0_03_FLEXPWM1_PWMB01, config_pines);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_10_FLEXPWM1_PWMA03, 0U);	// ----- [PWM1, módulo 3, canal A] {D5}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_10_FLEXPWM1_PWMA03, config_pines);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B0_11_FLEXPWM1_PWMB03, 0U);	// ----- [PWM1, módulo 3, canal B] {D2}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B0_11_FLEXPWM1_PWMB03, config_pines);

	// Configuración de pines para ADC -------------------------------------------------------------
	uint32_t config_ADC =
		IOMUXC_SW_PAD_CTL_PAD_SRE(0U)	|	// Slew Rate: Slow
		IOMUXC_SW_PAD_CTL_PAD_DSE(0U)	|	// Drive Stregnth: Deshabilitado (antes R0/6)
		IOMUXC_SW_PAD_CTL_PAD_SPEED(2U)	|	// Speed: Medium (100MHz)
		IOMUXC_SW_PAD_CTL_PAD_ODE(0U)	|	// Open Drain: Deshabilitado
		IOMUXC_SW_PAD_CTL_PAD_PKE(1U)	|	// Pull/Keeper Enable: Habilitado (Antes deshabilitado)
		IOMUXC_SW_PAD_CTL_PAD_PUE(1U)	|	// Pull/Keeper Select: Pull (Antes keeper)
		IOMUXC_SW_PAD_CTL_PAD_PUS(2U)	|	// Pull Up/Down Config: 100k Ohm Pull Up (Antes Pull Down)
		IOMUXC_SW_PAD_CTL_PAD_HYS(0U);		// Hysteresis Enable: Deshabilitado
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, 0U);	// ----- [ADC1, canal 15] {A0}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_10_GPIO1_IO26, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, 0U);	// ----- [ADC1, canal  0] {A1}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_11_GPIO1_IO27, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, 0U);	// ----- [ADC1, canal  9] {A2}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_04_GPIO1_IO20, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, 0U);	// ----- [ADC2, canal 10] {A3}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_05_GPIO1_IO21, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, 0U);	// ----- [ADC2, canal  6] {A4}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_01_GPIO1_IO17, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, 0U);	// ----- [ADC2, canal  5] {A5}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_00_GPIO1_IO16, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, 0U);	// ----- [ADC1, canal  8] {D7}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_03_GPIO1_IO19, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_02_GPIO1_IO18, 0U);	// ----- [ADC2, canal  7] {D6}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_02_GPIO1_IO18, config_ADC);
	IOMUXC_SetPinMux(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, 0U);	// ----- [ADC1, canal 11] {D1}
	IOMUXC_SetPinConfig(IOMUXC_GPIO_AD_B1_06_GPIO1_IO22, config_ADC);
}


